7767517
414 462
Input                    in0                      0 1 in0
Convolution              conv_24                  1 1 in0 1 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=648
HardSwish                hswish_150               1 1 1 2 0=0.166667 1=0.5
Split                    splitncnn_0              1 2 2 3 4
ConvolutionDepthWise     convdw_294               1 1 4 5 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216 7=24
Convolution              conv_25                  1 1 5 6 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
HardSwish                hswish_151               1 1 6 7 0=0.166667 1=0.5
Convolution              conv_26                  1 1 3 8 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=192
HardSwish                hswish_152               1 1 8 9 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_295               1 1 9 10 0=8 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=72 7=8
Split                    splitncnn_1              1 2 10 11 12
Pooling                  gap_0                    1 1 12 13 0=1 4=1
Convolution              convrelu_0               1 1 13 14 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16 9=1
Convolution              conv_28                  1 1 14 15 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16
HardSigmoid              hsigmoid_136             1 1 15 16 0=0.166667 1=0.5
Reshape                  reshape_272              1 1 16 17 0=1 1=1 2=-1
BinaryOp                 mul_0                    2 1 11 17 18 0=2
Convolution              conv_29                  1 1 18 19 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
HardSwish                hswish_153               1 1 19 20 0=0.166667 1=0.5
Concat                   cat_0                    2 1 7 20 21 0=0
ConvolutionDepthWise     convdw_296               1 1 21 22 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
HardSwish                hswish_154               1 1 22 23 0=0.166667 1=0.5
Convolution              conv_30                  1 1 23 24 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
HardSwish                hswish_155               1 1 24 25 0=0.166667 1=0.5
Split                    splitncnn_2              1 2 25 26 27
ConvolutionDepthWise     convdw_297               1 1 27 28 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32
Convolution              conv_31                  1 1 28 29 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
HardSwish                hswish_156               1 1 29 30 0=0.166667 1=0.5
Convolution              conv_32                  1 1 26 31 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
HardSwish                hswish_157               1 1 31 32 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_298               1 1 32 33 0=12 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=108 7=12
Split                    splitncnn_3              1 2 33 34 35
Pooling                  gap_1                    1 1 35 36 0=1 4=1
Convolution              convrelu_1               1 1 36 37 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36 9=1
Convolution              conv_34                  1 1 37 38 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36
HardSigmoid              hsigmoid_137             1 1 38 39 0=0.166667 1=0.5
Reshape                  reshape_273              1 1 39 40 0=1 1=1 2=-1
BinaryOp                 mul_1                    2 1 34 40 41 0=2
Convolution              conv_35                  1 1 41 42 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=288
HardSwish                hswish_158               1 1 42 43 0=0.166667 1=0.5
Concat                   cat_1                    2 1 30 43 44 0=0
ConvolutionDepthWise     convdw_299               1 1 44 45 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
HardSwish                hswish_159               1 1 45 46 0=0.166667 1=0.5
Convolution              conv_36                  1 1 46 47 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_160               1 1 47 48 0=0.166667 1=0.5
Slice                    split_0                  1 2 48 49 50 -23300=2,24,24 1=0
Convolution              conv_37                  1 1 50 51 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSwish                hswish_161               1 1 51 52 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_300               1 1 52 53 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24
Split                    splitncnn_4              1 2 53 54 55
Pooling                  gap_2                    1 1 55 56 0=1 4=1
Convolution              convrelu_2               1 1 56 57 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144 9=1
Convolution              conv_39                  1 1 57 58 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144
HardSigmoid              hsigmoid_138             1 1 58 59 0=0.166667 1=0.5
Reshape                  reshape_274              1 1 59 60 0=1 1=1 2=-1
BinaryOp                 mul_2                    2 1 54 60 61 0=2
Convolution              conv_40                  1 1 61 62 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSwish                hswish_162               1 1 62 63 0=0.166667 1=0.5
Concat                   cat_2                    2 1 49 63 64 0=0
ShuffleChannel           channelshuffle_14        1 1 64 65 0=2 1=0
Slice                    split_1                  1 2 65 66 67 -23300=2,24,24 1=0
Convolution              conv_41                  1 1 67 68 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSwish                hswish_163               1 1 68 69 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_301               1 1 69 70 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=216 7=24
Split                    splitncnn_5              1 2 70 71 72
Pooling                  gap_3                    1 1 72 73 0=1 4=1
Convolution              convrelu_3               1 1 73 74 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144 9=1
Convolution              conv_43                  1 1 74 75 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144
HardSigmoid              hsigmoid_139             1 1 75 76 0=0.166667 1=0.5
Reshape                  reshape_275              1 1 76 77 0=1 1=1 2=-1
BinaryOp                 mul_3                    2 1 71 77 78 0=2
Convolution              conv_44                  1 1 78 79 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSwish                hswish_164               1 1 79 80 0=0.166667 1=0.5
Concat                   cat_3                    2 1 66 80 81 0=0
ShuffleChannel           channelshuffle_15        1 1 81 82 0=2 1=0
Split                    splitncnn_6              1 3 82 83 84 85
ConvolutionDepthWise     convdw_302               1 1 85 86 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 7=48
Convolution              conv_45                  1 1 86 87 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_165               1 1 87 88 0=0.166667 1=0.5
Convolution              conv_46                  1 1 84 89 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
HardSwish                hswish_166               1 1 89 90 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_303               1 1 90 91 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216 7=24
Split                    splitncnn_7              1 2 91 92 93
Pooling                  gap_4                    1 1 93 94 0=1 4=1
Convolution              convrelu_4               1 1 94 95 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144 9=1
Convolution              conv_48                  1 1 95 96 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144
HardSigmoid              hsigmoid_140             1 1 96 97 0=0.166667 1=0.5
Reshape                  reshape_276              1 1 97 98 0=1 1=1 2=-1
BinaryOp                 mul_4                    2 1 92 98 99 0=2
Convolution              conv_49                  1 1 99 100 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
HardSwish                hswish_167               1 1 100 101 0=0.166667 1=0.5
Concat                   cat_4                    2 1 88 101 102 0=0
ConvolutionDepthWise     convdw_304               1 1 102 103 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
HardSwish                hswish_168               1 1 103 104 0=0.166667 1=0.5
Convolution              conv_50                  1 1 104 105 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_169               1 1 105 106 0=0.166667 1=0.5
Slice                    split_2                  1 2 106 107 108 -23300=2,48,48 1=0
Convolution              conv_51                  1 1 108 109 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_170               1 1 109 110 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_305               1 1 110 111 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_8              1 2 111 112 113
Pooling                  gap_5                    1 1 113 114 0=1 4=1
Convolution              convrelu_5               1 1 114 115 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_53                  1 1 115 116 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_141             1 1 116 117 0=0.166667 1=0.5
Reshape                  reshape_277              1 1 117 118 0=1 1=1 2=-1
BinaryOp                 mul_5                    2 1 112 118 119 0=2
Convolution              conv_54                  1 1 119 120 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_171               1 1 120 121 0=0.166667 1=0.5
Concat                   cat_5                    2 1 107 121 122 0=0
ShuffleChannel           channelshuffle_16        1 1 122 123 0=2 1=0
Slice                    split_3                  1 2 123 124 125 -23300=2,48,48 1=0
Convolution              conv_55                  1 1 125 126 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_172               1 1 126 127 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_306               1 1 127 128 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_9              1 2 128 129 130
Pooling                  gap_6                    1 1 130 131 0=1 4=1
Convolution              convrelu_6               1 1 131 132 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_57                  1 1 132 133 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_142             1 1 133 134 0=0.166667 1=0.5
Reshape                  reshape_278              1 1 134 135 0=1 1=1 2=-1
BinaryOp                 mul_6                    2 1 129 135 136 0=2
Convolution              conv_58                  1 1 136 137 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_173               1 1 137 138 0=0.166667 1=0.5
Concat                   cat_6                    2 1 124 138 139 0=0
ShuffleChannel           channelshuffle_17        1 1 139 140 0=2 1=0
Slice                    split_4                  1 2 140 141 142 -23300=2,48,48 1=0
Convolution              conv_59                  1 1 142 143 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_174               1 1 143 144 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_307               1 1 144 145 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_10             1 2 145 146 147
Pooling                  gap_7                    1 1 147 148 0=1 4=1
Convolution              convrelu_7               1 1 148 149 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_61                  1 1 149 150 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_143             1 1 150 151 0=0.166667 1=0.5
Reshape                  reshape_279              1 1 151 152 0=1 1=1 2=-1
BinaryOp                 mul_7                    2 1 146 152 153 0=2
Convolution              conv_62                  1 1 153 154 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_175               1 1 154 155 0=0.166667 1=0.5
Concat                   cat_7                    2 1 141 155 156 0=0
ShuffleChannel           channelshuffle_18        1 1 156 157 0=2 1=0
Slice                    split_5                  1 2 157 158 159 -23300=2,48,48 1=0
Convolution              conv_63                  1 1 159 160 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_176               1 1 160 161 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_308               1 1 161 162 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_11             1 2 162 163 164
Pooling                  gap_8                    1 1 164 165 0=1 4=1
Convolution              convrelu_8               1 1 165 166 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_65                  1 1 166 167 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_144             1 1 167 168 0=0.166667 1=0.5
Reshape                  reshape_280              1 1 168 169 0=1 1=1 2=-1
BinaryOp                 mul_8                    2 1 163 169 170 0=2
Convolution              conv_66                  1 1 170 171 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_177               1 1 171 172 0=0.166667 1=0.5
Concat                   cat_8                    2 1 158 172 173 0=0
ShuffleChannel           channelshuffle_19        1 1 173 174 0=2 1=0
Slice                    split_6                  1 2 174 175 176 -23300=2,48,48 1=0
Convolution              conv_67                  1 1 176 177 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_178               1 1 177 178 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_309               1 1 178 179 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_12             1 2 179 180 181
Pooling                  gap_9                    1 1 181 182 0=1 4=1
Convolution              convrelu_9               1 1 182 183 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_69                  1 1 183 184 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_145             1 1 184 185 0=0.166667 1=0.5
Reshape                  reshape_281              1 1 185 186 0=1 1=1 2=-1
BinaryOp                 mul_9                    2 1 180 186 187 0=2
Convolution              conv_70                  1 1 187 188 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_179               1 1 188 189 0=0.166667 1=0.5
Concat                   cat_9                    2 1 175 189 190 0=0
ShuffleChannel           channelshuffle_20        1 1 190 191 0=2 1=0
Slice                    split_7                  1 2 191 192 193 -23300=2,48,48 1=0
Convolution              conv_71                  1 1 193 194 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_180               1 1 194 195 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_310               1 1 195 196 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_13             1 2 196 197 198
Pooling                  gap_10                   1 1 198 199 0=1 4=1
Convolution              convrelu_10              1 1 199 200 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_73                  1 1 200 201 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_146             1 1 201 202 0=0.166667 1=0.5
Reshape                  reshape_282              1 1 202 203 0=1 1=1 2=-1
BinaryOp                 mul_10                   2 1 197 203 204 0=2
Convolution              conv_74                  1 1 204 205 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_181               1 1 205 206 0=0.166667 1=0.5
Concat                   cat_10                   2 1 192 206 207 0=0
ShuffleChannel           channelshuffle_21        1 1 207 208 0=2 1=0
Split                    splitncnn_14             1 3 208 209 210 211
ConvolutionDepthWise     convdw_311               1 1 211 212 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96
Convolution              conv_75                  1 1 212 213 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8448
HardSwish                hswish_182               1 1 213 214 0=0.166667 1=0.5
Convolution              conv_76                  1 1 210 215 0=44 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4224
HardSwish                hswish_183               1 1 215 216 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_312               1 1 216 217 0=44 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=396 7=44
Split                    splitncnn_15             1 2 217 218 219
Pooling                  gap_11                   1 1 219 220 0=1 4=1
Convolution              convrelu_11              1 1 220 221 0=11 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=484 9=1
Convolution              conv_78                  1 1 221 222 0=44 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=484
HardSigmoid              hsigmoid_147             1 1 222 223 0=0.166667 1=0.5
Reshape                  reshape_283              1 1 223 224 0=1 1=1 2=-1
BinaryOp                 mul_11                   2 1 218 224 225 0=2
Convolution              conv_79                  1 1 225 226 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3872
HardSwish                hswish_184               1 1 226 227 0=0.166667 1=0.5
Concat                   cat_11                   2 1 214 227 228 0=0
ConvolutionDepthWise     convdw_313               1 1 228 229 0=176 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1584 7=176
HardSwish                hswish_185               1 1 229 230 0=0.166667 1=0.5
Convolution              conv_80                  1 1 230 231 0=176 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=30976
HardSwish                hswish_186               1 1 231 232 0=0.166667 1=0.5
Slice                    split_8                  1 2 232 233 234 -23300=2,88,88 1=0
Convolution              conv_81                  1 1 234 235 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7744
HardSwish                hswish_187               1 1 235 236 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_314               1 1 236 237 0=88 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=792 7=88
Split                    splitncnn_16             1 2 237 238 239
Pooling                  gap_12                   1 1 239 240 0=1 4=1
Convolution              convrelu_12              1 1 240 241 0=22 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1936 9=1
Convolution              conv_83                  1 1 241 242 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1936
HardSigmoid              hsigmoid_148             1 1 242 243 0=0.166667 1=0.5
Reshape                  reshape_284              1 1 243 244 0=1 1=1 2=-1
BinaryOp                 mul_12                   2 1 238 244 245 0=2
Convolution              conv_84                  1 1 245 246 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7744
HardSwish                hswish_188               1 1 246 247 0=0.166667 1=0.5
Concat                   cat_12                   2 1 233 247 248 0=0
ShuffleChannel           channelshuffle_22        1 1 248 249 0=2 1=0
Slice                    split_9                  1 2 249 250 251 -23300=2,88,88 1=0
Convolution              conv_85                  1 1 251 252 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7744
HardSwish                hswish_189               1 1 252 253 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_315               1 1 253 254 0=88 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=792 7=88
Split                    splitncnn_17             1 2 254 255 256
Pooling                  gap_13                   1 1 256 257 0=1 4=1
Convolution              convrelu_13              1 1 257 258 0=22 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1936 9=1
Convolution              conv_87                  1 1 258 259 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1936
HardSigmoid              hsigmoid_149             1 1 259 260 0=0.166667 1=0.5
Reshape                  reshape_285              1 1 260 261 0=1 1=1 2=-1
BinaryOp                 mul_13                   2 1 255 261 262 0=2
Convolution              conv_88                  1 1 262 263 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7744
HardSwish                hswish_190               1 1 263 264 0=0.166667 1=0.5
Concat                   cat_13                   2 1 250 264 265 0=0
ShuffleChannel           channelshuffle_23        1 1 265 266 0=2 1=0
Convolution              conv_89                  1 1 266 267 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16896
HardSwish                hswish_191               1 1 267 268 0=0.166667 1=0.5
Split                    splitncnn_18             1 3 268 269 270 271
Convolution              conv_90                  1 1 209 272 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_192               1 1 272 273 0=0.166667 1=0.5
Convolution              conv_91                  1 1 83 274 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
HardSwish                hswish_193               1 1 274 275 0=0.166667 1=0.5
Interp                   upsample_264             1 1 270 276 0=1 1=2.0 2=2.0 6=0
Concat                   cat_14                   2 1 276 273 277 0=0
Split                    splitncnn_19             1 2 277 278 279
Convolution              conv_92                  1 1 279 280 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_194               1 1 280 281 0=0.166667 1=0.5
Convolution              conv_93                  1 1 281 282 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_195               1 1 282 283 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_316               1 1 283 284 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_196               1 1 284 285 0=0.166667 1=0.5
Convolution              conv_94                  1 1 285 286 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_197               1 1 286 287 0=0.166667 1=0.5
Convolution              conv_95                  1 1 278 288 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_198               1 1 288 289 0=0.166667 1=0.5
Concat                   cat_15                   2 1 287 289 290 0=0
Convolution              conv_96                  1 1 290 291 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_199               1 1 291 292 0=0.166667 1=0.5
Split                    splitncnn_20             1 2 292 293 294
Interp                   upsample_265             1 1 294 295 0=1 1=2.0 2=2.0 6=0
Concat                   cat_16                   2 1 295 275 296 0=0
Split                    splitncnn_21             1 2 296 297 298
Convolution              conv_97                  1 1 298 299 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_200               1 1 299 300 0=0.166667 1=0.5
Convolution              conv_98                  1 1 300 301 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_201               1 1 301 302 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_317               1 1 302 303 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_202               1 1 303 304 0=0.166667 1=0.5
Convolution              conv_99                  1 1 304 305 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_203               1 1 305 306 0=0.166667 1=0.5
Convolution              conv_100                 1 1 297 307 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_204               1 1 307 308 0=0.166667 1=0.5
Concat                   cat_17                   2 1 306 308 309 0=0
Convolution              conv_101                 1 1 309 310 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_205               1 1 310 311 0=0.166667 1=0.5
Split                    splitncnn_22             1 2 311 312 313
ConvolutionDepthWise     convdw_318               1 1 313 314 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
HardSwish                hswish_206               1 1 314 315 0=0.166667 1=0.5
Convolution              conv_102                 1 1 315 316 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_207               1 1 316 317 0=0.166667 1=0.5
Concat                   cat_18                   2 1 317 293 318 0=0
Split                    splitncnn_23             1 2 318 319 320
Convolution              conv_103                 1 1 320 321 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_208               1 1 321 322 0=0.166667 1=0.5
Convolution              conv_104                 1 1 322 323 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_209               1 1 323 324 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_319               1 1 324 325 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_210               1 1 325 326 0=0.166667 1=0.5
Convolution              conv_105                 1 1 326 327 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_211               1 1 327 328 0=0.166667 1=0.5
Convolution              conv_106                 1 1 319 329 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_212               1 1 329 330 0=0.166667 1=0.5
Concat                   cat_19                   2 1 328 330 331 0=0
Convolution              conv_107                 1 1 331 332 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_213               1 1 332 333 0=0.166667 1=0.5
Split                    splitncnn_24             1 2 333 334 335
ConvolutionDepthWise     convdw_320               1 1 335 336 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
HardSwish                hswish_214               1 1 336 337 0=0.166667 1=0.5
Convolution              conv_108                 1 1 337 338 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_215               1 1 338 339 0=0.166667 1=0.5
Concat                   cat_20                   2 1 339 269 340 0=0
Split                    splitncnn_25             1 2 340 341 342
Convolution              conv_109                 1 1 342 343 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_216               1 1 343 344 0=0.166667 1=0.5
Convolution              conv_110                 1 1 344 345 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_217               1 1 345 346 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_321               1 1 346 347 0=48 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1200 7=48
HardSwish                hswish_218               1 1 347 348 0=0.166667 1=0.5
Convolution              conv_111                 1 1 348 349 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_219               1 1 349 350 0=0.166667 1=0.5
Convolution              conv_112                 1 1 341 351 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_220               1 1 351 352 0=0.166667 1=0.5
Concat                   cat_21                   2 1 350 352 353 0=0
Convolution              conv_113                 1 1 353 354 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_221               1 1 354 355 0=0.166667 1=0.5
Split                    splitncnn_26             1 2 355 356 357
ConvolutionDepthWise     convdw_322               1 1 271 358 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
HardSwish                hswish_222               1 1 358 359 0=0.166667 1=0.5
Convolution              conv_114                 1 1 359 360 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_223               1 1 360 361 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_323               1 1 357 362 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
HardSwish                hswish_224               1 1 362 363 0=0.166667 1=0.5
Convolution              conv_115                 1 1 363 364 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_225               1 1 364 365 0=0.166667 1=0.5
BinaryOp                 add_14                   2 1 361 365 366 0=0
ConvolutionDepthWise     convdw_324               1 1 312 367 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_226               1 1 367 368 0=0.166667 1=0.5
Convolution              conv_116                 1 1 368 369 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_227               1 1 369 370 0=0.166667 1=0.5
Split                    splitncnn_27             1 2 370 371 372
ConvolutionDepthWise     convdw_325               1 1 372 373 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_228               1 1 373 374 0=0.166667 1=0.5
Convolution              conv_117                 1 1 374 375 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_229               1 1 375 376 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_326               1 1 371 377 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_230               1 1 377 378 0=0.166667 1=0.5
Convolution              conv_119                 1 1 378 379 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_231               1 1 379 380 0=0.166667 1=0.5
Convolution              conv_120                 1 1 380 381 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Convolution              convsigmoid_14           1 1 376 382 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680 9=4
Reshape                  reshape_286              1 1 382 383 0=768 1=80
Reshape                  reshape_287              1 1 381 384 0=768 1=4
ConvolutionDepthWise     convdw_327               1 1 334 385 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_232               1 1 385 386 0=0.166667 1=0.5
Convolution              conv_121                 1 1 386 387 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_233               1 1 387 388 0=0.166667 1=0.5
Split                    splitncnn_28             1 2 388 389 390
ConvolutionDepthWise     convdw_328               1 1 390 391 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_234               1 1 391 392 0=0.166667 1=0.5
Convolution              conv_122                 1 1 392 393 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_235               1 1 393 394 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_329               1 1 389 395 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_236               1 1 395 396 0=0.166667 1=0.5
Convolution              conv_124                 1 1 396 397 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_237               1 1 397 398 0=0.166667 1=0.5
Convolution              conv_125                 1 1 398 399 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Convolution              convsigmoid_15           1 1 394 400 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680 9=4
Reshape                  reshape_288              1 1 400 401 0=192 1=80
Reshape                  reshape_289              1 1 399 402 0=192 1=4
ConvolutionDepthWise     convdw_330               1 1 356 403 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_238               1 1 403 404 0=0.166667 1=0.5
Convolution              conv_126                 1 1 404 405 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_239               1 1 405 406 0=0.166667 1=0.5
Split                    splitncnn_29             1 2 406 407 408
ConvolutionDepthWise     convdw_331               1 1 408 409 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_240               1 1 409 410 0=0.166667 1=0.5
Convolution              conv_127                 1 1 410 411 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_241               1 1 411 412 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_332               1 1 407 413 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_242               1 1 413 414 0=0.166667 1=0.5
Convolution              conv_129                 1 1 414 415 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_243               1 1 415 416 0=0.166667 1=0.5
Convolution              conv_130                 1 1 416 417 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Convolution              convsigmoid_16           1 1 412 418 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680 9=4
Reshape                  reshape_290              1 1 418 419 0=48 1=80
Reshape                  reshape_291              1 1 417 420 0=48 1=4
ConvolutionDepthWise     convdw_333               1 1 366 421 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_244               1 1 421 422 0=0.166667 1=0.5
Convolution              conv_131                 1 1 422 423 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_245               1 1 423 424 0=0.166667 1=0.5
Split                    splitncnn_30             1 2 424 425 426
ConvolutionDepthWise     convdw_334               1 1 426 427 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_246               1 1 427 428 0=0.166667 1=0.5
Convolution              conv_132                 1 1 428 429 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_247               1 1 429 430 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_335               1 1 425 431 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96
HardSwish                hswish_248               1 1 431 432 0=0.166667 1=0.5
Convolution              conv_134                 1 1 432 433 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
HardSwish                hswish_249               1 1 433 434 0=0.166667 1=0.5
Convolution              conv_135                 1 1 434 435 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
Convolution              convsigmoid_17           1 1 430 436 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680 9=4
Reshape                  reshape_292              1 1 436 437 0=12 1=80
Reshape                  reshape_293              1 1 435 438 0=12 1=4
Concat                   cat_22                   4 1 383 401 419 437 439 0=1
Permute                  permute_270              1 1 439 440 0=1
Concat                   cat_23                   4 1 384 402 420 438 441 0=1
Permute                  permute_271              1 1 441 442 0=1
MemoryData               pnnx_fold_anchor_points.1 0 1 443 0=2 1=1020
Split                    splitncnn_0              1 2 443 444 445
MemoryData               pnnx_fold_stride_tensor.1 0 1 446 0=1 1=1020
Slice                    split_10                 1 2 442 447 448 -23300=2,2,-233 1=1
BinaryOp                 sub_15                   2 1 444 447 449 0=1
Split                    splitncnn_31             1 2 449 450 451
BinaryOp                 add_16                   2 1 445 448 452 0=0
Split                    splitncnn_32             1 2 452 453 454
BinaryOp                 add_17                   2 1 450 453 455 0=0
BinaryOp                 div_18                   1 1 455 456 0=3 1=1 2=2.0
BinaryOp                 sub_19                   2 1 454 451 457 0=1
Concat                   cat_24                   2 1 456 457 458 0=1
BinaryOp                 mul_20                   2 1 458 446 459 0=2
MemoryData               pnnx_fold_1582           0 1 460 0=1 1=1020
Concat                   cat_25                   3 1 459 460 440 out0 0=1
